{
    "paragraph": "My name is Drew and I currently live in Portland, Oregon. I am currently working as a Data Engineer while continuing to grow my skills particularly in AI and LLMs. In addition to my main focus of data engineering, I also enjoy studying other elements of software development to assist in gaining a deeper understanding of the tech industry as a whole! In my free time, I enjoy creating and listening to music, doing Danzan Ryu Ju-Jitsu, and spending time in the beautiful outdoors, exploring with my wife and two daughters.",
    "name": "Drew Riley White",
    "title": "Data Engineer",
    "origin": "Born and raised in sunny San Diego!",
    "currentLocation": "Portland, Oregon",
    "sideBusiness": "I am also owner of a small business called 'Anvil Barber Co' which is a Barber Shop located in American Fork, Utah. Prior to being a Data Engineer I was in the barber industry for 10 years, it was a great experience and I learned a lot about business and people. I still enjoy cutting hair on the side and it's a great way to stay connected to the community.",
    "hobbies": ["Music", "Making and Playing music", "Danzan Ryu Ju-Jitsu", "Outdoors", "Enjoying good food", "Spending time with my family"],
    "instrument": "I play guitar, bass, and drums. My main instrument is guitar though. I have been playing music for most of my life and I have been in many bands and have had the opportunity to play shows. I have also been recording and producing my own music for the last 10 years. I have found that music is a great way to express myself and to connect with others. I am always looking for new people to play music with and new projects to work on. I am also always looking for new music to listen to!",
    "musicGenres": ["Metal of almost any sub-genre", "Punk Rock", "Synthwave", "As long as it's good!"],
    "jujitsu": "I have been practicing a style of Ju-Jitsu called Danzan Ryu for 5 + years and I am currently a brown belt. I have been gotten many opportunities to teach and assist in teaching and I have found it to be a great way to give back to the community and to help others grow.",
    "outdoors": "I love the outdoors and I am always looking for new places to explore. I try to get out and about with my family when I can. Living in the Pacific Northwest has been a great experience and I have found many new places to explore.",
    "food": "I love food and I love to cook. I would say my two favorite types of food are Mexican and Asian, with an extra fondness for mexican food coming from San Diego. When it comes to cooking I tend to wing it and I have found that I enjoy cooking more when I don't follow a recipe. I also enjoy trying new foods and new places to eat.",
    "sports": "I am a casual hockey fan and I enjoy watching the Anaheim Ducks although now the Seattle Kraken is growing on me. If martial arts count as a sport then I am also a fan of that! Danzan Ryu being my favorite of course.",
    "family": "I have been married to my wife for over a decade and we have two daughters. My wife is a great support and I am grateful for her. My daughters are a lot of fun. They are always keeping me on my toes and I am always learning from them.",
    "email": "d.white0002@gmail.com",
    "phone": "I prefer email!",
    "resumeLink": "https://docs.google.com/document/d/1fo8vGrJPk8-A0e0gKe5u0QPCAk489YZlrybjEVLF7q4/edit?usp=sharing",
    "socialLinks": {
      "LinkedIn": "https://www.linkedin.com/in/drew-riley-white/",
      "GitHub": "https://github.com/Drewrwhite"
    },
    "image": "images/yourimage.png"
  }